InformationRegisters/__СостоянияСообщенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостоянияСообщенийПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СообщенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СообщенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостоянияСообщенийПользователей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СообщениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	// Перенаправление.
	СообщениеАвтоПодборСервер(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры // СообщениеАвтоПодбор()

&НаСервере
Процедура СообщениеАвтоПодборСервер(Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 51
	                      |	__СообщенияПользователей.Сообщение КАК Сообщение
	                      |ИЗ
	                      |	РегистрСведений.__СообщенияПользователей КАК __СообщенияПользователей
	                      |ГДЕ
	                      |	__СообщенияПользователей.Сообщение ПОДОБНО &Сообщение
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Сообщение");
	Запрос.УстановитьПараметр("Сообщение", Текст + "%");
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СтандартнаяОбработка = Ложь; ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Сообщение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // СообщениеАвтоПодборСервер()

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	// Перенаправление.
	ДокументПриИзмененииСервер();
	
КонецПроцедуры // ДокументПриИзменении()

&НаСервере
Процедура ДокументПриИзмененииСервер()

	// Получатель.
	Запись.Получатель = Запись.Документ.Сотрудник;
	
КонецПроцедуры // ДокументПриИзмененииСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка формы.
	Элементы.Получено.Видимость = Не Запись.Получено;
	Элементы.Прочитано.Видимость = Запись.Получено;
	
КонецПроцедуры // ПриСозданииНаСервере()
